<template>
  <div style="margin:24px;justify-content: space-between;">
    <div ><h1 style="text-align: center; color: #008000;">Правила дорожного движения</h1></div>
    <div >
      <ul>
        <li><a href="#li1"><h4 style="color: #000000;">1. Общие положения</h4></a></li>
        <li><a href="#li2"><h4 style="color: #000000;">2. Общие обязанности водителей</h4></a></li>
        <li><a href="#li3"><h4 style="color: #000000;">3. Обязанности пешеходов</h4></a></li>
        <li><a href="#li4"><h4 style="color: #000000;">4. Обязанности пассажиров</h4></a></li>
      </ul>
    </div>
    <div >
      <h3><a name="li1">Общие положения</a></h3>
      <h5 style="text-align: justify;">1.1 Настоящие Правила дорожного движения (В дальнейшем – Правила) устанавливают единый порядок дорожного движения на всей территории Российской Федерации. Другие нормативные акты, касающиеся дорожного движения, должны основываться на требованиях Правил и не противоречить им.</h5>
      <br/>
      <h5 style="text-align: justify;">
        1.2 Участники дорожного движения должны действовать таким образом, чтобы не создавать опасности для движения и не причинять вреда.
        Запрещается повреждать или загрязнять покрытие дорог, снимать, загораживать, повреждать, самовольно устанавливать дорожные знаки, светофоры и другие технические средства организации движения, оставлять на дороге предметы, создающие помехи для движения. Лицо, создавшее помеху, обязано принять все возможные меры для ее устранения, а если это невозможно, то доступными средствами обеспечить информирование участников движения об опасности и сообщить в полицию.</h5>
    </div>
    <div >
      <h3><a name="li2">Общие обязанности водителей</a></h3>
      <h5 style="text-align: justify;">2.1 Водитель механического транспортного средства обязан:
        Иметь при себе и по требованию сотрудников полиции передавать им, для проверки:
        - водительское удостоверение или временное разрешение на право управления транспортным средством соответствующей категории или подкатегории;</h5>
      <br/>
      <h5 style="text-align: justify;">2.2 Водитель механического транспортного средства, участвующий в международном дорожном движении, обязан:
        - иметь при себе и по требованию сотрудников полиции передавать им для проверки регистрационные документы на данное транспортное средство (при наличии прицепа - и на прицеп) и водительское удостоверение, соответствующие Конвенции о дорожном движении, а также документы, предусмотренные таможенным законодательством Таможенного союза, с отметками таможенных органов, подтверждающими временный ввоз данного транспортного средства (при наличии прицепа - и прицепа);</h5>
    </div>
    <div >
      <h3><a name="li3">Обязанности пешеходов</a></h3>
      <h5 style="text-align: justify;">4.1 Пешеходы должны двигаться по тротуарам, пешеходным дорожкам, велопешеходным дорожкам, а при их отсутствии - по обочинам. Пешеходы, перевозящие или переносящие громоздкие предметы, а также лица, передвигающиеся в инвалидных колясках без двигателя, могут двигаться по краю проезжей части, если их движение по тротуарам или обочинам создает помехи для других пешеходов.</h5>
    </div>
    <div >
      <h3><a name="li4">Обязанности пассажиров</a></h3>
      <h5 style="text-align: justify;">5.1 Пассажиры обязаны:
        - при поездке на транспортном средстве, оборудованном ремнями безопасности, быть пристегнутыми ими, а при поездке на мотоцикле - быть в застегнутом мотошлеме;
      </h5>
      <br/>
      <h5 style="text-align: justify;">5.2 Пассажирам запрещается:
        - отвлекать водителя от управления транспортным средством во время его движения;</h5>
    </div>
  </div>
</template>

<script>
export default {
  // eslint-disable-next-line vue/multi-word-component-names
  name: "Top10"
}
</script>

<style scoped>

</style>
